# стандартаная проверка даты

import time


date = input('Date (dd.mm.yyyy): ')
try:
  valid_date = time.strptime(date, '%d.%m.%Y')
  print('Корректная', valid_date)
except ValueError:
  print('Некорректная')

# ==========================================
# ПРИМЕР
"""
Корректная дата

Историки проанализировали множество древних текстов и выписали
из них предполагаемые даты конца света, однако при переписывании
ошиблись в некоторых из них. Напишите программу, которая принимает
строки с датами до символа точки и для каждой из дат печатает
"Корректная" или "Некорректная", а затем выводит число –
количество корректных дат.
Для анализа даты напишите функцию check_date(). День, месяц и год
каждой даты вводятся через точку.

Sample Input 1:
19.05.2016
05.13.2010
21.12.2012
01.01.1000
32.04.2003
.

Sample Output 1:
Корректная
Некорректная
Корректная
Корректная
Некорректная
3

Sample Input 2:
15.02.10000
29.02.1980
27.05.1528
13.10.1736
40.06.431
31.07.5200
29.02.2016
.
Sample Output 2:
Корректная
Некорректная
Корректная
Корректная
Некорректная
Корректная
Корректная
5
"""
# Задача решена ниже для периода от 1000 до 9999 года,
# не видит даты свыше 9999.
# Надо расписывать полностью, ка начал делать в этом коде


# def check_date(date):
#     if len(date) == 10:
#         dd, mm, yyyy = date.split('.')
#         if len(dd) == 2 and len(mm) == 2 and len(yyyy) == 4:
#             if dd.isdigit() and mm.isdigit() and yyyy.isdigit():
#                 if (1 <= int(dd) <= 31) and (1 <= int(mm) <= 12) and (1 <= int(yyyy) <= 9999):
#                     if dd == '31' and (mm in ['01', '03', '05', '07', '08', '10', '12']):
#                         print('Дата: ', date)
#                     elif int(dd) < 31:
#                         print('Дата: ', date)
#
#
# while True:
#     data = input()
#     if data == '.':
#         break
#     else:
#         print(check_date(data))


# ==========================================
# Задача решена для периода от 1000 до 9999 года,
# не видит даты от 1 до 1000 и свыше 9999.
# Надо расписывать полностью

import time

def check_date(date):
    f = 'Корректная'
    try:
        valid_date = time.strptime(date, '%d.%m.%Y')
        f ='Корректная'
    except ValueError:
        f = 'Некорректная'
    return f


result = []
k = 0
while True:
    data = input()
    if data == '.':
        break
    else:
        res = check_date(data)
        result.append(res)

for r in result:
    if r == 'Корректная':
        k += 1

print(*result, sep='\n')
print(k)

# ========================================== 


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================


# ==========================================