"""
https://metanit.com/python/tutorial/

METANIT.COM
Руководство по языку программирования Python на русском языке с примерами

==========================================================================
https://pythontutor.ru/lessons/int_and_float/

ПИТОНТЬЮТОР - Бесплатный курс по программированию с нуля.
Работает прямо в браузере. Много примеров с разбором задач.

==========================================================================
https://docs-python.ru/tutorial/
Справочник по языку Python3.

==========================================================================
https://www.tutorialsteacher.com/python
отличный учебник-справочник
"""