"""
Задача №10

Меняем ориентацию ввода данных. Теперь данные подаются в столбец )

На вход этой задаче подаётся сначала количество элементов массива
- число n, причём гарантируется, что оно чётное. Затем подаются
сами элементы в столбец.

Надо считать данные в массив и вывести половину элементов одной
строкой через пробел, на следующей строке вывести вторую половину
элементов также через пробел.

Для продвинутых: если будете выводить другим способом, не
описанным в теории. То имейте в виду, что после последнего
символа в строке должен быть пробел. Иначе - тестирующая система не примет.

Sample Input:
6
кот
кит
крот
сок
срок
соль

Sample Output:
кот кит крот
сок срок соль
"""

n = int(input())     # читаем количество элементов в будущем массиве
A = []               # создали пустой массив (список)
for i in range(n):   # цикл на n повторений
    x = input()
    A.append(x)

for i in range(len(A)//2):
    print(A[i], end=' ')
print()
for i in range(len(A)//2, len(A)):
    print(A[i], end=' ')

# ===============================================
# Как-то неправильно решается!!!
b = int(input())
print(*[input() for i in range(b//2)], '')
print(*[input() for i in range(b//2)], '')

# ===============================================
s = [input() for _ in range(int(input()))]
[print(s[i], end=' ') for i in range(len(s)//2)]
print()
[print(i, end=' ') for i in s[len(s)//2:]]

# ===============================================
d = [input() for _ in range(int(input()))]
print(*d[:len(d)//2], '')
print(*d[len(d)//2:])

# ===============================================
b = int(input())
[print(*[input() for i in range(b//2)], '') for i in "ab"]

# ===============================================
n = int(input())
for i in range(n):
    print(input(), end=' ')
    if i == n//2-1:
        print()

# ===============================================
a = int(input()) // 2
[print(*[input() + ' ' for _ in range(a)], sep='') for _ in '12']

# ===============================================
li = [input() for i in range(int(input()))]

print(*li[:int(len(li)/2)], '')
print(*li[int(len(li)/2):], '')

# ===============================================
n = int(input())
x = []
for i in range(n):
    x.append(input())
for k in x[:n//2]:
    print(k, end=" ")
print()
for k in x[n//2:]:
    print(k, end=" ")

# ===============================================
n = int(input())
sp = []
for _ in range(n):
    sp.append(input())

for i in range(n):
    if n == i + i:
        print()
    print(sp[i], end=' ')