"""
Задача №7

На вход массива подаётся сначала количество элементов массива,
а потом сами элементы одной строкой через пробел.
Элементы массива - целые числа. Считайте данные в массив, и
выведите на печать элементы массива в столбец.

Sample Input:
8
3 2 3 3 5 6 12 7

Sample Output:
3
2
3
3
5
6
12
7
"""

n = int(input())     # читаем количество элементов в будущем массиве
A = list(map(int, input().split()))
for elem in A:
    print(elem)

# ===============================================
input()
print(*input().split(), sep='\n')

# ===============================================
input()
print(*map(int, input().split()), sep='\n')

# ===============================================
b = int(input())
a = input().split()
for i in range(b):
    print(a[i])

# ===============================================
n = int(input())
a = list(map(int, input().split()))
print(*a, sep='\n')

# ===============================================
n = int(input())
m = list(map(int,input().split()))
[print(i) for i in m]

# ===============================================
input()
for v in input().split():
    print(v)