"""
Задача №2

Напишите программу, которая создаёт массив, состоящий
из n нулей, (1 <= n <= 100). Число n подаётся с клавиатуры.
Массив выведите в квадратных скобках.

Sample Input:
3

Sample Output:
[0, 0, 0]
"""

print([0] * int(input()))

# ==========================================
n = int(input())
m = [0]
print(m * n)

# ==========================================
print([0 for _ in range(int(input()))])

# ==========================================
a = []
for i in range(int(input())):
    a.append(0)
print(a)
