
multi = [
    [5, 6, 7, 8],
    [15, 13, 9, 4],
    [6, 18, 15, 28]
]
print(multi)  # Вывод матрицы можно осуществить одним оператором,
# но такой простой способ не позволяет выполнять какой-то предварительной обработки элементов:
# =====================================================================================
print(multi[0])  # вывод первого элемента
# =====================================================================================
x = [x[0] for x in multi], [x[1] for x in multi], [x[2] for x in multi], [x[3] for x in multi]
print(x)  # вывод всех столбцов в строку
# =====================================================================================
x = [x[:] for x in multi]  # вывод в строку
print(x)
# =====================================================================================
column = []
for column in multi:
    for elem in column:
        print(elem, end=', ')  # выводит список элементов, но в конце зачем то добавляет
                                # порядок элементов. Постараться выяснить.
# =====================================================================================
# Еще один интересный пример вывода двумерного числового списка на экран построчно
a = [[1, 2, 3, 4], [5, 6], [7, 8, 9]]
for row in a:
    for elem in row:
        print(elem, end=' ')
    print()  # Оба варианта приводят к одинаковому результату

a = [[1, 2, 3, 4], [5, 6], [7, 8, 9]]
for i in range(len(a)):
    for j in range(len(a[i])):
        print(a[i][j], end=' ')
    print()