"""
Сочетания клавиш PyCharm

Последнее изменение: 9 июня 2021 г.

Все сочетания клавиш для распечатки
https://resources.jetbrains.com/storage/products/pycharm/docs/PyCharm_ReferenceCard.pdf?_ga=2.62503919.219908342.1625490948-2092108925.1610216984
"""
"""
PyCharm имеет сочетания клавиш для большинства команд, 
связанных с редактированием, навигацией, рефакторингом, 
отладкой и другими задачами. Запомнив эти горячие клавиши, 
вы сможете работать более продуктивно, удерживая руки на клавиатуре.

В следующей таблице перечислены некоторые из наиболее полезных 
горячих клавиш для изучения:

Ярлык	                  Действие

Двойной Shift	        Искать везде
                        Быстро находите любой файл, действие, класс, 
                        символ, окно инструмента или настройку в PyCharm, 
                        в вашем проекте и в текущем репозитории Git.

Ctrl+E	                Посмотреть последние файлы
                        Выберите из списка недавно открытый файл.            

Ctrl+Shift+A	        Найти действие
                        Найдите команду и выполните ее, откройте окно 
                        инструмента или найдите параметр.

Alt+Enter               Показать действия контекста
                        Быстрые исправления выделенных ошибок и предупреждений, 
                        намеренные действия по улучшению и оптимизации вашего кода.
Ctrl+/
Ctrl+Shift+/	        Добавить / удалить строку или заблокировать комментарий
                        Закомментируйте строку или блок кода.

Alt+F7	                Найти использование
                        Покажите все места, где элемент кода используется 
                        в вашем проекте.                

F2
Shift+F2                Переход между проблемами кода
                        Переход к следующей или предыдущей выделенной ошибке.

Ctrl+W
Ctrl+Shift+W	        Расширить или сузить выделение
                        Увеличивайте или уменьшайте объем выбора в соответствии 
                        с конкретными конструкциями кода.
"""